<template>
    <div class="py-7.5 border-y border-fline2 flex flex-col gap-7.5">
        <div class="flex flex-col gap-5 max-w-4xl">
            <h3 class="font-Nekst text-fblack text-xl leading-1.2">Вечерние экскурсии по Казани</h3>
            <p class="text-sm text-fmain leading-1.4">Не стоит забывать, что один и тот же город в разное время суток раскрывается по-разному. Если вы уже успели осмотреть столицу Татарстана днем, то вечерние экскурсии по Казани - то, что обязательно необходимо посетить, чтобы ваше
                представление о городе было полным. Экскурсия по ночной Казани от Экскурсионного центра создана чтобы показать туристам самые величественные здания нашего города, которые хорошо подсвечиваются в вечернее время. Более того - наш автобус сделает три остановки около самых
                знаковых построек: Театра кукол "Экият", Дворца земледельцев и Чаши. Это одни из самых красивых зданий Казани вечером, возле которых фотографируются все путешественники, приезжающие в наш город.</p>
        </div>
        <div class="flex flex-col gap-5 max-w-4xl">
            <h3 class="font-Nekst text-fblack text-xl leading-1.2">Экскурсии по Казани - ночная Казань в свете фонарей</h3>
            <p class="text-sm text-fmain leading-1.4">Прогулки по историческому центру одинаково хороши как днём, так и вечером. Более того, летними ночами на город спускается приятная прохлада, и экскурсии по Казани ("Ночная Казань" в частности) становятся ещё более приятными для
                туристов. Отсутствие плотного автомобильного движения дает возможность вдоволь полюбоваться красотами ночной Казани из окна комфортабельного автобуса и сделать красивые снимки.
                <br><br>
                В рамках экскурсии "вечерняя Казань" вы увидите не только историческую часть города, но и правобережье Казанки - ультрасовременную половину города с модными зданиями из стекла и бетона. На ночной экскурсии кроме старого города вы увидите жемчужину Казани - Загс "Чаша",
                красивые спортивные сооружения и самые современные улицы города, вытянувшиеся вдоль реки Казанка.
            </p>
        </div>
    </div>
</template>

<script setup>

</script>