<template>
    <div class="col-span-full h-500px lg:h-760px -mb-5 lg:-mb-7.5">
        <SwiperOne title="Название отеля"></SwiperOne>
    </div>
    <div class="col-span-full pt-7.5 lg:pt-15 rounded-3xl z-1 bg-white">
        <ContainerSidebar class="wrapper">
            <div class="flex flex-col gap-15">
                <div class="flex flex-col gap-7.5">
                    <Breadcrumbs class="mb-5 lt-lg:hidden"></Breadcrumbs>
                    <h1 class="font-Nekst text-2xl lg:text-4xl leading-1.1 text-fblack lt-lg:-mb-2.5">Название отеля</h1>
                    <div class="flex lg:flex-wrap gap-2.5 overflow-auto scroll-h-0">
                        <div class="flex gap-2.5 rounded-full shadow-[0_4px_23px_0_rgba(0,0,0,.07)] border border-black/5">
                            <div class="flex gap-2.5 px-3 py-2.5 min-w-max text-black2 font-medium leading-1.2 text-base items-center">
                                <span>
                                    <svg xmlns="http://www.w3.org/2000/svg" width="28" height="28" viewBox="0 0 28 28" fill="none">
                                        <path opacity="0.3" fill-rule="evenodd" clip-rule="evenodd"
                                            d="M12.8333 12.2509L12.25 12.8342L5.52893 9.77273C3.80232 8.98625 3.0402 6.94899 3.82668 5.22238C4.00541 4.82999 4.25642 4.47476 4.56658 4.17524C5.91428 2.87378 8.06184 2.91127 9.36329 4.25897C9.66834 4.57485 9.90915 4.94696 10.0724 5.35463L12.8333 12.2509ZM5.72434 5.37414C5.05605 6.0195 5.03265 7.07943 5.67206 7.74157C6.31148 8.4037 7.37158 8.4173 8.03987 7.77194C8.70816 7.12658 8.73157 6.06664 8.09215 5.40451C7.45274 4.74238 6.39263 4.72878 5.72434 5.37414Z"
                                            fill="#19B6D6" />
                                        <path fill-rule="evenodd" clip-rule="evenodd"
                                            d="M11.5959 23.2461C8.40666 20.0568 8.40666 14.8859 11.5959 11.6966C14.7852 8.50737 19.9561 8.50737 23.1454 11.6966C26.3346 14.8859 26.3346 20.0568 23.1454 23.2461C19.9561 26.4353 14.7852 26.4353 11.5959 23.2461ZM17.5 23.9173C21.0439 23.9173 23.9167 21.0445 23.9167 17.5007C23.9167 13.9568 21.0439 11.084 17.5 11.084C13.9562 11.084 11.0834 13.9568 11.0834 17.5007C11.0834 21.0445 13.9562 23.9173 17.5 23.9173ZM17.5 22.7507C14.6005 22.7507 12.25 20.4002 12.25 17.5007C12.25 14.6012 14.6005 12.2507 17.5 12.2507C20.3995 12.2507 22.75 14.6012 22.75 17.5007C22.75 20.4002 20.3995 22.7507 17.5 22.7507Z"
                                            fill="#19B6D6" />
                                    </svg>
                                </span>
                                Шведский стол
                            </div>
                        </div>
                        <div class="flex gap-2.5 rounded-full shadow-[0_4px_23px_0_rgba(0,0,0,.07)] border border-black/5">
                            <div class="flex gap-2.5 px-3 py-2.5 min-w-max text-black2 font-medium leading-1.2 text-base items-center">
                                <span class="shrink-0">
                                    <svg xmlns="http://www.w3.org/2000/svg" width="28" height="28" viewBox="0 0 28 28" fill="none">
                                        <path opacity="0.3" fill-rule="evenodd" clip-rule="evenodd"
                                            d="M12.8333 12.2509L12.25 12.8342L5.52893 9.77273C3.80232 8.98625 3.0402 6.94899 3.82668 5.22238C4.00541 4.82999 4.25642 4.47476 4.56658 4.17524C5.91428 2.87378 8.06184 2.91127 9.36329 4.25897C9.66834 4.57485 9.90915 4.94696 10.0724 5.35463L12.8333 12.2509ZM5.72434 5.37414C5.05605 6.0195 5.03265 7.07943 5.67206 7.74157C6.31148 8.4037 7.37158 8.4173 8.03987 7.77194C8.70816 7.12658 8.73157 6.06664 8.09215 5.40451C7.45274 4.74238 6.39263 4.72878 5.72434 5.37414Z"
                                            fill="#19B6D6" />
                                        <path fill-rule="evenodd" clip-rule="evenodd"
                                            d="M11.5959 23.2461C8.40666 20.0568 8.40666 14.8859 11.5959 11.6966C14.7852 8.50737 19.9561 8.50737 23.1454 11.6966C26.3346 14.8859 26.3346 20.0568 23.1454 23.2461C19.9561 26.4353 14.7852 26.4353 11.5959 23.2461ZM17.5 23.9173C21.0439 23.9173 23.9167 21.0445 23.9167 17.5007C23.9167 13.9568 21.0439 11.084 17.5 11.084C13.9562 11.084 11.0834 13.9568 11.0834 17.5007C11.0834 21.0445 13.9562 23.9173 17.5 23.9173ZM17.5 22.7507C14.6005 22.7507 12.25 20.4002 12.25 17.5007C12.25 14.6012 14.6005 12.2507 17.5 12.2507C20.3995 12.2507 22.75 14.6012 22.75 17.5007C22.75 20.4002 20.3995 22.7507 17.5 22.7507Z"
                                            fill="#19B6D6" />
                                    </svg>
                                </span>
                                Континентальный завтрак
                            </div>
                        </div>
                        <div class="flex gap-2.5 rounded-full shadow-[0_4px_23px_0_rgba(0,0,0,.07)] border border-black/5">
                            <div class="flex gap-2.5 px-3 py-2.5 min-w-max text-black2 font-medium leading-1.2 text-base items-center">
                                <span>
                                    <svg xmlns="http://www.w3.org/2000/svg" width="28" height="28" viewBox="0 0 28 28" fill="none">
                                        <path opacity="0.3" fill-rule="evenodd" clip-rule="evenodd"
                                            d="M12.8333 12.2509L12.25 12.8342L5.52893 9.77273C3.80232 8.98625 3.0402 6.94899 3.82668 5.22238C4.00541 4.82999 4.25642 4.47476 4.56658 4.17524C5.91428 2.87378 8.06184 2.91127 9.36329 4.25897C9.66834 4.57485 9.90915 4.94696 10.0724 5.35463L12.8333 12.2509ZM5.72434 5.37414C5.05605 6.0195 5.03265 7.07943 5.67206 7.74157C6.31148 8.4037 7.37158 8.4173 8.03987 7.77194C8.70816 7.12658 8.73157 6.06664 8.09215 5.40451C7.45274 4.74238 6.39263 4.72878 5.72434 5.37414Z"
                                            fill="#19B6D6" />
                                        <path fill-rule="evenodd" clip-rule="evenodd"
                                            d="M11.5959 23.2461C8.40666 20.0568 8.40666 14.8859 11.5959 11.6966C14.7852 8.50737 19.9561 8.50737 23.1454 11.6966C26.3346 14.8859 26.3346 20.0568 23.1454 23.2461C19.9561 26.4353 14.7852 26.4353 11.5959 23.2461ZM17.5 23.9173C21.0439 23.9173 23.9167 21.0445 23.9167 17.5007C23.9167 13.9568 21.0439 11.084 17.5 11.084C13.9562 11.084 11.0834 13.9568 11.0834 17.5007C11.0834 21.0445 13.9562 23.9173 17.5 23.9173ZM17.5 22.7507C14.6005 22.7507 12.25 20.4002 12.25 17.5007C12.25 14.6012 14.6005 12.2507 17.5 12.2507C20.3995 12.2507 22.75 14.6012 22.75 17.5007C22.75 20.4002 20.3995 22.7507 17.5 22.7507Z"
                                            fill="#19B6D6" />
                                    </svg>
                                </span>
                                Паркинг
                            </div>
                        </div>
                        <div class="flex gap-2.5 rounded-full shadow-[0_4px_23px_0_rgba(0,0,0,.07)] border border-black/5">
                            <div class="flex gap-2.5 px-3 py-2.5 min-w-max text-black2 font-medium leading-1.2 text-base items-center">
                                <span>
                                    <svg xmlns="http://www.w3.org/2000/svg" width="28" height="28" viewBox="0 0 28 28" fill="none">
                                        <path opacity="0.3" fill-rule="evenodd" clip-rule="evenodd"
                                            d="M12.8333 12.2509L12.25 12.8342L5.52893 9.77273C3.80232 8.98625 3.0402 6.94899 3.82668 5.22238C4.00541 4.82999 4.25642 4.47476 4.56658 4.17524C5.91428 2.87378 8.06184 2.91127 9.36329 4.25897C9.66834 4.57485 9.90915 4.94696 10.0724 5.35463L12.8333 12.2509ZM5.72434 5.37414C5.05605 6.0195 5.03265 7.07943 5.67206 7.74157C6.31148 8.4037 7.37158 8.4173 8.03987 7.77194C8.70816 7.12658 8.73157 6.06664 8.09215 5.40451C7.45274 4.74238 6.39263 4.72878 5.72434 5.37414Z"
                                            fill="#19B6D6" />
                                        <path fill-rule="evenodd" clip-rule="evenodd"
                                            d="M11.5959 23.2461C8.40666 20.0568 8.40666 14.8859 11.5959 11.6966C14.7852 8.50737 19.9561 8.50737 23.1454 11.6966C26.3346 14.8859 26.3346 20.0568 23.1454 23.2461C19.9561 26.4353 14.7852 26.4353 11.5959 23.2461ZM17.5 23.9173C21.0439 23.9173 23.9167 21.0445 23.9167 17.5007C23.9167 13.9568 21.0439 11.084 17.5 11.084C13.9562 11.084 11.0834 13.9568 11.0834 17.5007C11.0834 21.0445 13.9562 23.9173 17.5 23.9173ZM17.5 22.7507C14.6005 22.7507 12.25 20.4002 12.25 17.5007C12.25 14.6012 14.6005 12.2507 17.5 12.2507C20.3995 12.2507 22.75 14.6012 22.75 17.5007C22.75 20.4002 20.3995 22.7507 17.5 22.7507Z"
                                            fill="#19B6D6" />
                                    </svg>
                                </span>
                                Панорманый вид
                            </div>
                        </div>
                        <div class="flex gap-2.5 rounded-full shadow-[0_4px_23px_0_rgba(0,0,0,.07)] border border-black/5">
                            <div class="flex gap-2.5 px-3 py-2.5 min-w-max text-black2 font-medium leading-1.2 text-base items-center">
                                <span>
                                    <svg xmlns="http://www.w3.org/2000/svg" width="28" height="28" viewBox="0 0 28 28" fill="none">
                                        <path opacity="0.3" fill-rule="evenodd" clip-rule="evenodd"
                                            d="M12.8333 12.2509L12.25 12.8342L5.52893 9.77273C3.80232 8.98625 3.0402 6.94899 3.82668 5.22238C4.00541 4.82999 4.25642 4.47476 4.56658 4.17524C5.91428 2.87378 8.06184 2.91127 9.36329 4.25897C9.66834 4.57485 9.90915 4.94696 10.0724 5.35463L12.8333 12.2509ZM5.72434 5.37414C5.05605 6.0195 5.03265 7.07943 5.67206 7.74157C6.31148 8.4037 7.37158 8.4173 8.03987 7.77194C8.70816 7.12658 8.73157 6.06664 8.09215 5.40451C7.45274 4.74238 6.39263 4.72878 5.72434 5.37414Z"
                                            fill="#19B6D6" />
                                        <path fill-rule="evenodd" clip-rule="evenodd"
                                            d="M11.5959 23.2461C8.40666 20.0568 8.40666 14.8859 11.5959 11.6966C14.7852 8.50737 19.9561 8.50737 23.1454 11.6966C26.3346 14.8859 26.3346 20.0568 23.1454 23.2461C19.9561 26.4353 14.7852 26.4353 11.5959 23.2461ZM17.5 23.9173C21.0439 23.9173 23.9167 21.0445 23.9167 17.5007C23.9167 13.9568 21.0439 11.084 17.5 11.084C13.9562 11.084 11.0834 13.9568 11.0834 17.5007C11.0834 21.0445 13.9562 23.9173 17.5 23.9173ZM17.5 22.7507C14.6005 22.7507 12.25 20.4002 12.25 17.5007C12.25 14.6012 14.6005 12.2507 17.5 12.2507C20.3995 12.2507 22.75 14.6012 22.75 17.5007C22.75 20.4002 20.3995 22.7507 17.5 22.7507Z"
                                            fill="#19B6D6" />
                                    </svg>
                                </span>
                                WI FI
                            </div>
                        </div>
                        <div class="flex gap-2.5 rounded-full shadow-[0_4px_23px_0_rgba(0,0,0,.07)] border border-black/5">
                            <div class="flex gap-2.5 px-3 py-2.5 min-w-max text-black2 font-medium leading-1.2 text-base items-center">
                                <span>
                                    <svg xmlns="http://www.w3.org/2000/svg" width="28" height="28" viewBox="0 0 28 28" fill="none">
                                        <path opacity="0.3" fill-rule="evenodd" clip-rule="evenodd"
                                            d="M12.8333 12.2509L12.25 12.8342L5.52893 9.77273C3.80232 8.98625 3.0402 6.94899 3.82668 5.22238C4.00541 4.82999 4.25642 4.47476 4.56658 4.17524C5.91428 2.87378 8.06184 2.91127 9.36329 4.25897C9.66834 4.57485 9.90915 4.94696 10.0724 5.35463L12.8333 12.2509ZM5.72434 5.37414C5.05605 6.0195 5.03265 7.07943 5.67206 7.74157C6.31148 8.4037 7.37158 8.4173 8.03987 7.77194C8.70816 7.12658 8.73157 6.06664 8.09215 5.40451C7.45274 4.74238 6.39263 4.72878 5.72434 5.37414Z"
                                            fill="#19B6D6" />
                                        <path fill-rule="evenodd" clip-rule="evenodd"
                                            d="M11.5959 23.2461C8.40666 20.0568 8.40666 14.8859 11.5959 11.6966C14.7852 8.50737 19.9561 8.50737 23.1454 11.6966C26.3346 14.8859 26.3346 20.0568 23.1454 23.2461C19.9561 26.4353 14.7852 26.4353 11.5959 23.2461ZM17.5 23.9173C21.0439 23.9173 23.9167 21.0445 23.9167 17.5007C23.9167 13.9568 21.0439 11.084 17.5 11.084C13.9562 11.084 11.0834 13.9568 11.0834 17.5007C11.0834 21.0445 13.9562 23.9173 17.5 23.9173ZM17.5 22.7507C14.6005 22.7507 12.25 20.4002 12.25 17.5007C12.25 14.6012 14.6005 12.2507 17.5 12.2507C20.3995 12.2507 22.75 14.6012 22.75 17.5007C22.75 20.4002 20.3995 22.7507 17.5 22.7507Z"
                                            fill="#19B6D6" />
                                    </svg>
                                </span>
                                Кондиционер
                            </div>
                        </div>
                    </div>
                    <p class="text-fmain text-sm leading-1.4 max-w-4xl">Увидеть Казань в свете вечерних огней — обязательный пункт путешествия в наш город. В ходе экскурсии вы проедете по центру города с рассказом экскурсовода об истории улиц и памятников и сделаете несколько фотоостановок у самых
                        ярко подсвеченных достопримечательностей. У Центра семьи «Казан» вы узнаете, почему наш город так назван и что за таинственные существа охраняют центральный ЗАГС города, у Дворца земледельцев восхититесь роскошью, торжественностью и величием современного памятника архитектуры,
                        рядом с Театром кукол погрузитесь в атмосферу детской сказки и волшебства. Панорама ночного Казанского Кремля с красавицей мечетью Кул-Шариф и древним Благовещенским собором пополнит вашу серию фотографий тысячелетней Казани. ВНИМАНИЕ! В период новогодних каникул заезд к чаше по
                        возможности (возможно перекрытие дорог в связи с установкой у чаши центральной городской елки)</p>
                    <NuxtLink class="flex items-center gap-1" to="/test">
                        <Icon name="Map" class="text-white fill-fblue shrink-0" size="27"></Icon>
                        <span class="text-fblue text-sm leading-1.4 font-medium underline">Республика Татарстан, Казань, улица Баумана, 68</span>
                    </NuxtLink>
                </div>
                <seo-block class="lt-lg:hidden"></seo-block>
                <Reviews></Reviews>
            </div>
        </ContainerSidebar>
    </div>
    <div class="lt-lg:hidden mt-15 col-span-full overflow-hidden">
        <SwiperExcursions class="wrapper border-t border-fline2 pt-5"></SwiperExcursions>
    </div>

    <Recommendations class="mt-20 lg:mt-37.5" />
</template>

<script setup>

</script>